/*
位元運算子
1.boolean-->合-->true
		 -->不合-->false
2.&(and和),|(or或),^(xor或),~(補數)
3.轉二進位制計算
*/
class Ex9
{
	public static void main(String[] args)
	{
		int a=5;//5轉換為二進位制-->0000,0101
		int b=6;//2轉換為二進位制-->0000,0110

		System.out.println("5&6="+(a&b));
		/*
		   0000,0101
		   0000,0110
		-->0000,0100-->4
		*/
		System.out.println("5|6="+(a|b));
		/*
		   0000,0101
		   0000,0110
		-->0000,0111-->7
		*/
		System.out.println("5^6="+(a^b));
		/*
		   0000,0101
		   0000,0110
		-->0000,0011-->3
		*/
		System.out.println("~5="+(~5));
		/*
		   0000,0101
		-->1111,1010-->-128+64+32+16+8+2=-6
		*/
	}
}